#IDS
ids = \
about \
general general.formats general.reset \
encode encode.load encode.input encode.image encode.image.prew encode.image.upd_sav encode.password encode.password.safety encode.channels \
decode decode.failed decode.load decode.password

#ABOUT
about.topic = O programu
about.text = JSteg - aplikace pro steganografii. \n\
			 \u00A9 Jakub \u0161antora, 2017
#GENERAL
general.topic = Obecné
general.text = Nápvo\u011Bda k obecným funkcím aplikace.
general.formats.topic = Formáty
general.formats.text = Dostupné formáty jsou: \n\
						\t PNG, BMP, JPG, GIF pro vstup \u0161ifrování  \n\
						\t PNG, BMP pro výstup \u0161ifrování a vstup de\u0161ifrování
general.reset.topic = Hard reset
general.reset.text = Pokud se vám neda\u0159í obnovit výchozí nastavení aplikace, je mo\u017Ené provést Hard Reset smazáním souboru settings.jsteg.
#ENCODING
encode.topic = Za\u0161ifrování
encode.text = K za\u0161ifrování zprávy postupuje následovn\u011B: \n\
			  1) Nahrajte obrázek\n\
			  2) Napi\u0161te zprávu\n\
			  3) Volitelné: Zvolte heslo\n\
			  4) Volitelné: Zvolte barevné kanály\n\
			  5) Aktualizujte \u0161iforvaný obrázek\n\
			  6) Ulo\u017Ete za\u0161ifrovaný obrázek.
encode.load.topic = Nahrání obrázku
encode.load.text = Obrázek, do kterého bude zpráva skryta m\u016F\u017Eete nahrát kliknutím na pole ozna\u010Dené "Obrázek". \n\
					 Dostupné formáty jsou: PNG, BMP, JPG a GIF obrázky. \n\
					 PNG obrázky nezachovávají svou pr\u016Fhlednost.
encode.input.topic = Zadání zprávy
encode.input.text = Zprávu, kterou chcete za\u0161ifrovat m\u016F\u017Eete zadat do pole ozna\u010Deného "Text k \u0161ifrování". \n\
					Pod tímto polem vidíte po\u010Det dostupných znak\u016F zprávy a znak\u016F ji\u017E pou\u017Eitých. \
					Tento po\u010Det závisí na rozm\u011Brech obrázku a pou\u017Eitých barevných kanálech. \n\
					Pokud zm\u011Bníte obrázek nebo volbu barevných kanál\u016F, v\u0161echny znaky p\u0159es limit budou ztraceny.
encode.image.topic = Za\u0161ifrovaný obrázek
encode.image.text = Nápov\u011Bda k \u0161ifrování a ulo\u017Eení obrázku.
encode.image.prew.topic = Náhled ovlivn\u011Bných pixel\u016F
encode.image.prew.text = Náhled zakódovaného obrázku je mo\u017Ené vid\u011Bt pod textem "Ovlivn\u011Bné pixely". \n\
					Náhled není skute\u010Dnou reprezentací výsledného orbázku, pouze znázor\u0148uje pixely, v ncih\u017E se bude nacházet zpráva (a tudí\u017E zm\u011Bní barvu).\n\
					Náhled m\u016F\u017Eete zv\u011Bt\u0161it kliknutím na miniaturu.
encode.image.upd_sav.topic = Aktualizace a ulo\u017Eení
encode.image.upd_sav.text = Aktualizovat \u0161ifrovaný obrázek m\u016F\u017Eete pomocí tla\u010Dítka "Aktualizovat za\u0161ifrovaný obrázek" a ulo\u017Eit pomocí "Ulo\u017Eit za\u0161ifrovaný obrázek". \n\
							Aktualizace je nutná p\u0159i ka\u017Edé zm\u011Bn\u011B textu nebo jiných parametr\u016F. \n\
							Dostupn\u011B výstupní formáty jsou PNG a BMP.
encode.password.topic = Zaheslování
encode.password.text = Za\u0161ifrovaná zpráva m\u016F\u017Ee být chrán\u011Bna heslem zadaným v polí\u010Dku "Heslo". \n\
					   Výsledný obrázek nebude dekódovatelný bez tohoto hesla.
encode.password.safety.topic = Bezpe\u010Dnost
encode.password.safety.text = Hesla ve skute\u010Dnosti nejsou unikátní - jeden obrázek m\u016F\u017Ee být dekódován více hesly, pokud mají stejný hash.\n\
							  To je ov\u0161em velice vyjíme\u010Dný p\u0159ípad a nem\u011Blo by \u010Dinit \u017Eádný problém.
encode.channels.topic = Barevné kanály
encode.channels.text = M\u016F\u017Eete vybrat do kterých kanál\u016F se zpráva zakóduje za\u0161krtnutím checkbox\u016F \u010Cervená, Zelená a Modrá.\n\
					   \u010Cím více kanál\u016F, tím del\u0161í m\u016F\u017Ee být zpráva. 
#DECODING
decode.topic = De\u0161ifrování
decode.text =  K de\u010Difrování zprávy postupuje následovn\u011B: \n\
			  1) Nahrajte obrázek\n\
			  2) Volitelné: Zvolte heslo\n\
			  3) Stiskn\u011Bte tla\u010Dítko De\u0161ifrovat\n\
			  4) Zpráva se zobrazí v poli vpravo.
decode.failed.topic = De\u0161ifrování selhalo
decode.failed.text = De\u0161ifrování m\u016F\u017Ee selhat z n\u011Bkoliak d\u016Fvod\u016F, nejpravd\u011Bpodobn\u011Bj\u0161í jsou:\n\
					 - \u0160patné heslo. \n\
					 - Obrázek neobsahuje zprávu. \n\
					 - R\u016Fzné pokro\u010Dilé nastavení programu na de\u0161iforvání a za\u0161ifrování.
decode.load.topic = Nahrání obrázku
decode.load.text = Obrázek, do kterého bude zpráva skryta m\u016F\u017Eete nahrát kliknutím na pole ozna\u010Dené "Obrázek". \n\
					 Dostupné formáty jsou: PNG a BMP obrázky.
decode.password.topic = Pou\u017Eití hesla
decode.password.text = Pokud p\u0159i za\u0161ifrování bylo pou\u017Eito heslo, je nutné ho vepsat do pole "Heslo" 